<a href="https://colab.research.google.com/github/xlpbodily/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/James_Chapman_LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-11-05 22:45:45--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.204.93
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.204.93|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  83.3MB/s    in 2.4s

2019-11-05 22:45:47 (83.3 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [0]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [0]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [0]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
##### YOUR CODE HERE #####
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [0]:
order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)
print(order_products__prior.sample(5))

(32434489, 4)
          order_id  product_id  add_to_cart_order  reordered
10017432   1057703       33720                 10          0
30017916   3166248       22935                 12          1
3722300     393162       49451                  8          0
7340785     774908       19057                  8          1
17045204   1797933       37710                  3          1

In [0]:
products = pd.read_csv('products.csv')
print(products.shape)
products.sample(5)

(49688, 4)

       product_id  ... department_id
12072       12073  ...            19
37333       37334  ...             7
5538         5539  ...            20
11368       11369  ...            13
19444       19445  ...            17

[5 rows x 4 columns]

In [0]:
order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)
order_products__train.sample(5)

(1384617, 4)

         order_id  product_id  add_to_cart_order  reordered
137801     336414        2704                 33          0
252973     617896       23734                  6          1
22432       54098       39475                 12          1
1243784   3072080       31717                  6          0
685563    1684759        4656                 21          1

In [0]:
orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.sample(5)

(3421083, 7)

         order_id  user_id  ... order_hour_of_day  days_since_prior_order
1495254    996210    89849  ...                17                     5.0
2802549   1250461   169058  ...                18                    30.0
1997486    940882   120026  ...                13                     7.0
2849650   1881985   171929  ...                16                     NaN
3002707   2413964   181163  ...                17                     5.0

[5 rows x 7 columns]

In [0]:
order_products = pd.concat([order_products__prior, order_products__train])
order_products.shape

(33819106, 4)

In [0]:
product_names = ['Banana', 
                 'Bag of Organic Bananas', 
                 'Organic Strawberries', 
                 'Organic Baby Spinach', 
                 'Organic Hass Avocado', 
                 'Organic Avocado', 
                 'Large Lemon', 
                 'Strawberries', 
                 'Limes', 
                 'Organic Whole Milk']

In [0]:
condition = products['product_name'].isin(product_names)
products=products[condition]
product_list = (products[['product_id', 'product_name']]
            .merge(order_products[['order_id', 'product_id']])
            .merge(orders[['order_id', 'order_number']]))
print(product_list.shape)
product_list

(2418314, 4)

         product_id            product_name  order_id  order_number
0             13176  Bag of Organic Bananas         5            42
1             47209    Organic Hass Avocado         5            42
2             13176  Bag of Organic Bananas        27            16
3             47766         Organic Avocado        27            16
4             13176  Bag of Organic Bananas        29            14
...             ...                     ...       ...           ...
2418309       47766         Organic Avocado   3416675            52
2418310       47766         Organic Avocado   3417614            37
2418311       47766         Organic Avocado   3418070             9
2418312       47766         Organic Avocado   3420232            16
2418313       47766         Organic Avocado   3420578             6

[2418314 rows x 4 columns]

In [0]:
product_list_final = product_list.groupby('product_name')['order_number'].sum()
product_list_final

product_name
Bag of Organic Bananas    8071203
Banana                    8476644
Large Lemon               2862480
Limes                     2536919
Organic Avocado           2856520
Organic Baby Spinach      4412435
Organic Hass Avocado      4291905
Organic Strawberries      4884244
Organic Whole Milk        2844206
Strawberries              2639733
Name: order_number, dtype: int64

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
flights = sns.load_dataset('flights')

In [0]:
##### YOUR CODE HERE #####
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [0]:
list(flights.columns)
flights.columns.tolist()

['year', 'month', 'passengers']

In [0]:
flights = flights.reset_index()
flights

     index  year      month  passengers
0        0  1949    January         112
1        1  1949   February         118
2        2  1949      March         132
3        3  1949      April         129
4        4  1949        May         121
..     ...   ...        ...         ...
139    139  1960     August         606
140    140  1960  September         508
141    141  1960    October         461
142    142  1960   November         390
143    143  1960   December         432

[144 rows x 4 columns]

In [0]:
mypivot=flights.pivot_table(index='month', columns='year', values='passengers')
mypivot

year       1949  1950  1951  1952  1953  ...  1956  1957  1958  1959  1960
month                                    ...
January     112   115   145   171   196  ...   284   315   340   360   417
February    118   126   150   180   196  ...   277   301   318   342   391
March       132   141   178   193   236  ...   317   356   362   406   419
April       129   135   163   181   235  ...   313   348   348   396   461
May         121   125   172   183   229  ...   318   355   363   420   472
June        135   149   178   218   243  ...   374   422   435   472   535
July        148   170   199   230   264  ...   413   465   491   548   622
August      148   170   199   242   272  ...   405   467   505   559   606
September   136   158   184   209   237  ...   355   404   404   463   508
October     119   133   162   191   211  ...   306   347   359   407   461
November    104   114   146   172   180  ...   271   305   310   362   390
December    118   140   166   194   201  ...   306   336   337   405   432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####